"""
练习3:  在一个my.log 的文件中不间断的写入如下内容
        每隔2s写入一次 sleep

 1.  2020-01-01 10:10:10
 2.  2020-01-01 10:10:12
 3.  2020-01-01 10:10:14
 4.  2020-01-01 10:10:16
 5.  2020-01-01 10:28:49
 6.  2020-01-01 10:28:51

要求 : 1. 每写一行都要实时显示出来
      2. 程序终止后,重新启动那么会继续
      往下写,并且序号能够衔接

思路: 什么方式打开合适?
      序号怎么衔接 (先判断有多少行)
"""

from time import sleep,ctime

f = open('my.log','a+',buffering=1)

n = 1 # 每次从行数 + 1 开始

f.seek(0,0) # 重置文件偏移量 放开头

# 每有一行 n + 1
for line in f:
    n += 1

while True:
    sleep(2) # 2s写一次
    msg = "%d. %s\n"%(n,ctime())
    f.write(msg)
    n += 1

f.close()







